In [1]:
import pandas as pd

### Core Data Structures

In [2]:
s1 = pd.Series([73, 84, 90, 69, 91])

In [3]:
type(s1)

pandas.core.series.Series

In [6]:
s2 = pd.Series([73, 84, 90, 69, 91], index = ["Dharmik", "Harsh", "Darsh", "Khushi", "Kirti"])

In [7]:
s2

Dharmik    73
Harsh      84
Darsh      90
Khushi     69
Kirti      91
dtype: int64

In [8]:
Data = {
    "name": ["Dharmik", "Kirti", "Harsh"],
    "Age": [26, 25, 26],
    "City": ["Frankfurt", "Surat", "Frankfurt"]
}

In [10]:
df = pd.DataFrame(Data)

In [11]:
df

      name  Age       City
0  Dharmik   26  Frankfurt
1    Kirti   25      Surat
2    Harsh   26  Frankfurt

In [12]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
df.columns

Index(['name', 'Age', 'City'], dtype='object')

### Creating DataFrames

In [17]:
data = [["Dharmik", 76], ["Kirti", 95], ["Harsh", 86], ["Khushi", 94]]

In [18]:
df = pd.DataFrame(data, columns=["Name", "Marks"])

In [19]:
df

      Name  Marks
0  Dharmik     76
1    Kirti     95
2    Harsh     86
3   Khushi     94

In [20]:
data = {"a":[1, 2, 3], "b":[4, 5, 6]}

In [21]:
df = pd.DataFrame(data)

In [22]:
df

   a  b
0  1  4
1  2  5
2  3  6

In [24]:
import numpy as np

In [28]:
arr = np.array([[1, 2], [4, 5]])

In [29]:
df = pd.DataFrame(arr, columns=["A", "B"])

In [30]:
df

   A  B
0  1  2
1  4  5

In [34]:
df = pd.read_excel("Book1.xlsx")

In [35]:
df

      name school  marks
0     Hari   PPSU     99
1  Dharmik   SSGV     89
2    Kirti    VNG     89
3    Harsh   SSGV     89
4   Khushi    NKV     89

In [36]:
df = pd.read_csv("Book1.csv")

In [37]:
df

      name school  marks
0     Hari   PPSU     99
1  Dharmik   SSGV     89
2    Kirti    VNG     89
3    Harsh   SSGV     89
4   Khushi    NKV     89

In [39]:
df = pd.read_json("data.json")

In [40]:
df

      Name Language
0  Dharmik   Python
1    Kirti   Physio

In [44]:
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [45]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

### EDA (Exploratory Data Analysis)

In [46]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [47]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [49]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [51]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [52]:
df.shape

(244, 7)

### Data Selection & Filtering

In [53]:
df["total_bill"]

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [54]:
df[["tip", "day"]]

      tip   day
0    1.01   Sun
1    1.66   Sun
2    3.50   Sun
3    3.31   Sun
4    3.61   Sun
..    ...   ...
239  5.92   Sat
240  2.00   Sat
241  2.00   Sat
242  1.75   Sat
243  3.00  Thur

[244 rows x 2 columns]

In [55]:
df.loc[1]

total_bill     10.34
tip             1.66
sex             Male
smoker            No
day              Sun
time          Dinner
size               3
Name: 1, dtype: object

In [56]:
df.iloc[1]

total_bill     10.34
tip             1.66
sex             Male
smoker            No
day              Sun
time          Dinner
size               3
Name: 1, dtype: object

In [57]:
df.at[0, "smoker"]

'No'

In [58]:
df.iat[15, 4]

'Sun'

In [61]:
df[df['size']>4]

     total_bill   tip     sex smoker   day    time  size
125       29.80  4.20  Female     No  Thur   Lunch     6
141       34.30  6.70    Male     No  Thur   Lunch     6
142       41.19  5.00    Male     No  Thur   Lunch     5
143       27.05  5.00  Female     No  Thur   Lunch     6
155       29.85  5.14  Female     No   Sun  Dinner     5
156       48.17  5.00    Male     No   Sun  Dinner     6
185       20.69  5.00    Male     No   Sun  Dinner     5
187       30.46  2.00    Male    Yes   Sun  Dinner     5
216       28.15  3.00    Male    Yes   Sat  Dinner     5

In [62]:
df[df['size']>4]['tip']

125    4.20
141    6.70
142    5.00
143    5.00
155    5.14
156    5.00
185    5.00
187    2.00
216    3.00
Name: tip, dtype: float64

In [64]:
df[(df['size']>4) & (df['tip']>4)]

     total_bill   tip     sex smoker   day    time  size
125       29.80  4.20  Female     No  Thur   Lunch     6
141       34.30  6.70    Male     No  Thur   Lunch     6
142       41.19  5.00    Male     No  Thur   Lunch     5
143       27.05  5.00  Female     No  Thur   Lunch     6
155       29.85  5.14  Female     No   Sun  Dinner     5
156       48.17  5.00    Male     No   Sun  Dinner     6
185       20.69  5.00    Male     No   Sun  Dinner     5

In [65]:
df.query("tip > 3.00 and day == 'Thur'")

     total_bill   tip     sex smoker   day   time  size
77        27.20  4.00    Male     No  Thur  Lunch     4
81        16.66  3.40    Male     No  Thur  Lunch     2
83        32.68  5.00    Male    Yes  Thur  Lunch     2
85        34.83  5.17  Female     No  Thur  Lunch     4
87        18.28  4.00    Male     No  Thur  Lunch     2
88        24.71  5.85    Male     No  Thur  Lunch     2
125       29.80  4.20  Female     No  Thur  Lunch     6
134       18.26  3.25  Female     No  Thur  Lunch     2
140       17.47  3.50  Female     No  Thur  Lunch     2
141       34.30  6.70    Male     No  Thur  Lunch     6
142       41.19  5.00    Male     No  Thur  Lunch     5
143       27.05  5.00  Female     No  Thur  Lunch     6
191       19.81  4.19  Female    Yes  Thur  Lunch     2
194       16.58  4.00    Male    Yes  Thur  Lunch     2
197       43.11  5.00  Female    Yes  Thur  Lunch     4
200       18.71  4.00    Male    Yes  Thur  Lunch     3
204       20.53  4.00    Male    Yes  Thur  Lunch     4
205       16.47  3.23  Female    Yes  Thur  Lunch     3

### Data Cleaning & Preprocessing

In [86]:
df = pd.read_csv("data_cleaning_sample.csv")

In [87]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [88]:
df.isnull()

    Name    Age   City  Gender  Email  Join Date
0  False  False  False   False  False      False
1  False   True  False   False  False      False
2  False  False  False   False  False      False
3  False   True  False   False  False      False
4  False  False  False   False  False      False
5   True  False  False   False  False       True
6  False  False  False   False  False      False
7  False  False  False   False  False      False
8  False   True  False   False  False      False

In [89]:
df.isnull().sum()

Name         1
Age          3
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [90]:
df.dropna()

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com    1/5/2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12/11/2019
6  Alice  25.0     New York      F  alice@example.com    1/5/2021
7  Alice  25.0     New York      F  alice@example.com    1/5/2021

In [91]:
df.dropna(axis=1)

          City Gender              Email
0     New York      F  alice@example.com
1        Delhi      M    charlie@example
2  Los Angeles      M    bob@example.com
3        Delhi      M    charlie@example
4       Mumbai      M  david@example.com
5        Delhi      F     eve@domain.com
6     New York      F  alice@example.com
7     New York      F  alice@example.com
8        Delhi      M    charlie@example

In [93]:
df.fillna(0)

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5        0  28.0        Delhi      F     eve@domain.com           0
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie   0.0        Delhi      M    charlie@example  20-07-2021

In [94]:
df["Age"].fillna(df["Age"].mean())

0    25.000000
1    25.833333
2    30.000000
3    25.833333
4    22.000000
5    28.000000
6    25.000000
7    25.000000
8    25.833333
Name: Age, dtype: float64

In [96]:
df.ffill()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5    David  28.0        Delhi      F     eve@domain.com  12/11/2019
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie  25.0        Delhi      M    charlie@example  20-07-2021

In [97]:
df.bfill()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  22.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5    Alice  28.0        Delhi      F     eve@domain.com    1/5/2021
6    Alice  25.0     New York      F  alice@example.com    1/5/2021
7    Alice  25.0     New York      F  alice@example.com    1/5/2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [98]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [99]:
df.drop_duplicates()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com    1/5/2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12/11/2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [100]:
df.duplicated(subset=["Name", "Age"])

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [101]:
df["Name"].str.lower()

0      alice
1    charlie
2        bob
3    charlie
4      david
5        NaN
6      alice
7      alice
8    charlie
Name: Name, dtype: object

In [102]:
df["City"].str.contains("delhi", case=False)

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7    False
8     True
Name: City, dtype: bool

In [103]:
df["Email"].str.split("@")

0    [alice, example.com]
1      [charlie, example]
2      [bob, example.com]
3      [charlie, example]
4    [david, example.com]
5       [eve, domain.com]
6    [alice, example.com]
7    [alice, example.com]
8      [charlie, example]
Name: Email, dtype: object

In [105]:
df["Age Group"] = df["Age"].apply(lambda x: "Adult" if x >= 18 else "Minor")

In [106]:
df

      Name   Age         City Gender              Email   Join Date Age Group
0    Alice  25.0     New York      F  alice@example.com    1/5/2021     Adult
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020     Adult
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor
4    David  22.0       Mumbai      M  david@example.com  12/11/2019     Adult
5      NaN  28.0        Delhi      F     eve@domain.com         NaN     Adult
6    Alice  25.0     New York      F  alice@example.com    1/5/2021     Adult
7    Alice  25.0     New York      F  alice@example.com    1/5/2021     Adult
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor

In [109]:
gender_map = {"M": "Male", "F": "Female", "O": "Others"}
df["Gender"] = df["Gender"].map(gender_map)

In [110]:
df

      Name   Age         City  Gender              Email   Join Date Age Group
0    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
1  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021     Minor
2      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020     Adult
3  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021     Minor
4    David  22.0       Mumbai    Male  david@example.com  12/11/2019     Adult
5      NaN  28.0        Delhi  Female     eve@domain.com         NaN     Adult
6    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
7    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
8  Charlie   NaN        Delhi    Male    charlie@example  20-07-2021     Minor

In [112]:
df["City"] = df["City"].replace({"Delhi": "New Delhi", "Mumbai": "New Mumbai"})

In [113]:
df

      Name   Age         City  Gender              Email   Join Date Age Group
0    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
1  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
2      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020     Adult
3  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
4    David  22.0   New Mumbai    Male  david@example.com  12/11/2019     Adult
5      NaN  28.0    New Delhi  Female     eve@domain.com         NaN     Adult
6    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
7    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
8  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor

### Data Transformation

In [114]:
df.sort_values("Join Date")

      Name   Age         City  Gender              Email   Join Date Age Group
0    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
6    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
7    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
4    David  22.0   New Mumbai    Male  david@example.com  12/11/2019     Adult
2      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020     Adult
1  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
3  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
8  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
5      NaN  28.0    New Delhi  Female     eve@domain.com         NaN     Adult

In [115]:
df.sort_values("Join Date", ascending=False)

      Name   Age         City  Gender              Email   Join Date Age Group
1  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
3  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
8  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
2      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020     Adult
4    David  22.0   New Mumbai    Male  david@example.com  12/11/2019     Adult
0    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
6    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
7    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
5      NaN  28.0    New Delhi  Female     eve@domain.com         NaN     Adult

In [120]:
df2 = df.sort_values(["Join Date", "Name"]).copy()

In [121]:
df2.reset_index()

,index,Name,Age,City,Gender,Email,Join Date,Age Group
0,0,Alice,25.0,New York,Female,alice@example.com,1/5/2021,Adult
1,6,Alice,25.0,New York,Female,alice@example.com,1/5/2021,Adult
2,7,Alice,25.0,New York,Female,alice@example.com,1/5/2021,Adult
3,4,David,22.0,New Mumbai,Male,david@example.com,12/11/2019,Adult
4,2,Bob,30.0,Los Angeles,Male,bob@example.com,15-06-2020,Adult
5,1,Charlie,NaN,New Delhi,Male,charlie@example,20-07-2021,Minor
6,3,Charlie,NaN,New Delhi,Male,charlie@example,20-07-2021,Minor
7,8,Charlie,NaN,New Delhi,Male,charlie@example,20-07-2021,Minor
8,5,NaN,28.0,New Delhi,Female,eve@domain.com,NaN,Adult

In [122]:
df2.reset_index(drop=True)

      Name   Age         City  Gender              Email   Join Date Age Group
0    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
1    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
2    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
3    David  22.0   New Mumbai    Male  david@example.com  12/11/2019     Adult
4      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020     Adult
5  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
6  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
7  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
8      NaN  28.0    New Delhi  Female     eve@domain.com         NaN     Adult

In [123]:
df2.reset_index(drop=True, inplace=True)

In [124]:
df2

      Name   Age         City  Gender              Email   Join Date Age Group
0    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
1    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
2    Alice  25.0     New York  Female  alice@example.com    1/5/2021     Adult
3    David  22.0   New Mumbai    Male  david@example.com  12/11/2019     Adult
4      Bob  30.0  Los Angeles    Male    bob@example.com  15-06-2020     Adult
5  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
6  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
7  Charlie   NaN    New Delhi    Male    charlie@example  20-07-2021     Minor
8      NaN  28.0    New Delhi  Female     eve@domain.com         NaN     Adult

In [130]:
df2["Rank"] = df2["Age"].rank(ascending=False, method="dense")

In [131]:
df2

,Name,Age,City,Gender,Email,Join Date,Age Group,Rank
0,Alice,25.0,New York,Female,alice@example.com,1/5/2021,Adult,3.0
1,Alice,25.0,New York,Female,alice@example.com,1/5/2021,Adult,3.0
2,Alice,25.0,New York,Female,alice@example.com,1/5/2021,Adult,3.0
3,David,22.0,New Mumbai,Male,david@example.com,12/11/2019,Adult,4.0
4,Bob,30.0,Los Angeles,Male,bob@example.com,15-06-2020,Adult,1.0
5,Charlie,NaN,New Delhi,Male,charlie@example,20-07-2021,Minor,NaN
6,Charlie,NaN,New Delhi,Male,charlie@example,20-07-2021,Minor,NaN
7,Charlie,NaN,New Delhi,Male,charlie@example,20-07-2021,Minor,NaN
8,NaN,28.0,New Delhi,Female,eve@domain.com,NaN,Adult,2.0

### Melt and Pivot

In [132]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [133]:
df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [140]:
# df.pivot(index="Name", columns="Subject", values="Score")

### Aggregation & Grouping

In [141]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [142]:
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [143]:
df.groupby("Department")["Salary"].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [144]:
df.groupby("Department")["Salary"].sum()

Department
HR           175
IT           163
Marketing    180
Sales        155
Name: Salary, dtype: int64

In [145]:
df.groupby("Department")["Salary"].min()

Department
HR           85
IT           78
Marketing    88
Sales        75
Name: Salary, dtype: int64

In [146]:
df.groupby("Department")["Salary"].max()

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

In [147]:
df.groupby("Department")["Salary"].count()

Department
HR           2
IT           2
Marketing    2
Sales        2
Name: Salary, dtype: int64

In [148]:
df.groupby("Team")["Salary"].agg(["mean", "max", "min"])

      mean  max  min
Team
A     87.5   90   85
B     81.5   85   78
C     90.0   92   88
D     77.5   80   75

In [149]:
type(df.groupby("Team")["Salary"].agg(["mean", "max", "min"]))

pandas.core.frame.DataFrame

In [150]:
df.groupby("Team")["Salary"].agg(
    ave_score="mean", 
    high_score="max",
    low_score="min"
)

      ave_score  high_score  low_score
Team
A          87.5          90         85
B          81.5          85         78
C          90.0          92         88
D          77.5          80         75

In [151]:
df["Team Avg"] = df.groupby("Team")["Salary"].transform("mean")

In [152]:
df

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
2         IT    B      M      78   30 2021-03-20      81.5
3         IT    B      F      85   22 2021-04-10      81.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0
6      Sales    D      M      75   21 2021-07-15      77.5
7      Sales    D      F      80   27 2021-08-01      77.5

In [153]:
df.groupby("Team").filter(lambda x:x["Salary"].mean() > 85)

  Department Team Gender  Salary  Age   JoinDate  Team Avg
0         HR    A      M      85   23 2020-01-10      87.5
1         HR    A      F      90   25 2020-02-15      87.5
4  Marketing    C      M      92   28 2020-05-30      90.0
5  Marketing    C      F      88   26 2020-06-25      90.0